brew "cmake"
brew "file-formula"
brew "openssl@3"
brew "iproute2mac"
brew "istioctl"
brew "neovim"
brew "node"
brew "skaffold"
brew "stow"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "watch"
brew "websocat"
brew "yq"
cask "1password-cli"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "confluentinc.vscode-confluent"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dotdevru.prettier-java"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "jeppeandersen.vscode-kafka"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode.vscode-speech"
vscode "nucllear.vscode-extension-auto-import"
vscode "oracle.oracle-java"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcegraph.cody-ai"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vsls-contrib.codetour"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "zh9528.file-size"
vscode "ziyasal.vscode-open-in-github"
